<a href="https://colab.research.google.com/github/hardikchoudhary/LearnPython/blob/master/Data_cleaning_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

***2.Problem Statement***
It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [0]:
import pandas as pd
import numpy as np

In [0]:
data={'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'], 
      'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
      'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
      'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']}

In [32]:
df=pd.DataFrame(data)
print(df)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# **Question 1.** Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column)

In [0]:
#get the first number and after that increase by 10 from lambda map function
firstFlight=df['FlightNumber'].iloc[0]

#get the length and then create the list that will work as index list to pass to the from lambda map function

print("Getting index as a list \n","*"*60)
indexList=list(np.arange(len(df['FlightNumber'])))
indexList

Getting index as a list
 ************************************************************

[0, 1, 2, 3, 4]

In [0]:
#Getting whole column increase by 10 and replaced back in the df
df['FlightNumber']=list(map(lambda x:firstFlight+10*x,indexList))

#changing whole column data type to integer from float
df['FlightNumber'] = df['FlightNumber'].astype(int)


print("Final output after Fill in missing Flightnumber increase by 10 and make the column an integer column  \n","*"*60)
print(df)

Final output after Fill in missing Flightnumber increase by 10 and make the column an integer column
 ************************************************************
            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []                 (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# **Question 2**. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.


1.   Lambda map function 
2.   Direct approach

In [0]:
def splitFunction(s):
  return s.split("_")[0]

#splitFunction("hardik_choudhary")

'hardik'

`Through the map function *lambda*`

In [33]:
df['From']=list(map(lambda x:x.split('_')[0],list(df['From_To'])))
df['To']=list(map(lambda x:x.split('_')[1],list(df['From_To'])))

print("Resulting data frame with from and to separate \n",df )

Resulting data frame with from and to separate
             From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN           NaN  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis           NaN  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

Direct approach

In [34]:
# new data frame with split value columns 
new = df["From_To"].str.split("_", expand = True) 

# making separate first name column from new data frame 
df["From"]= new[0] 
# making separate first name column from new data frame 
df["To"]= new[1] 

df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN           NaN  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis           NaN  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

# 3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [36]:

def firstUpper(strs):
  return strs.capitalize()


df['From']=list(map(firstUpper,list(df['From'])))
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    London      paris
1      MAdrid_miLAN           NaN  ...    Madrid      miLAN
2  londON_StockhOlm       10065.0  ...    London  StockhOlm
3    Budapest_PaRis           NaN  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

# 4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [38]:
df.drop(columns='From_To',inplace=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      paris
1           NaN            []                 (12)    Madrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    London  StockhOlm
3           NaN          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

# 5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.
Note: Solution submitted

In [59]:
#function to create the delay_1 delay_2 columns use of apply function
def createColumns(counters,dataFrame):
  return df['delays_'+counters+1]

SyntaxError: ignored

In [62]:
#use the max length function to find the maximum number of element in the list
#to create delay_1, delay_2 dynamically

recentDelays=list(df['RecentDelays'])
print("recent delays \n",recentDelays)

max_columnsCount=len(max(recentDelays,key=len))
print("total delay_? that needs to be created is \n",max_columnsCount)

#getting List
columnNumberList=np.arange(max_columnsCount)
print(columnNumberList)

recent delays
 [[23, 47], [], [24, 43, 87], [13], [67, 32]]
total delay_? that needs to be created is
 3
[0 1 2]

In [0]:
for n in columnNumberList:
  df['delays_'+n+1]=